In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("dataset_1.csv", index_col=0) #0 indica que la primera columna del archivo CSV será utilizada como el índice del data frame es la numeración de la tupla xD

In [4]:
df #Ver el data frame

       Edad Género  Ingresos  Altura    Ciudad Nivel_Educación  Hijos
0        82      F     62297    1.96   Phoenix             NaN      0
1        15      F     38674    1.83  New York             PhD      4
2       166    NaN     -1886    1.87       NaN       Bachelors     -5
3        95      M     29759    1.77   Chicago             PhD      4
4        36      M     99938    1.78   Phoenix             PhD      5
...     ...    ...       ...     ...       ...             ...    ...
99995    65      M     62403    1.95   Houston             NaN      1
99996    74      F     29457    1.81  New York          Master      3
99997    27      M     48147    1.88   Houston          Master      5
99998    39      M     92826    1.82  New York             NaN      2
99999    62      M     74762    1.90   Houston             PhD      3

[100000 rows x 7 columns]

In [5]:
df.describe()  # Generar estadisticas descriptivas

                Edad       Ingresos         Altura          Hijos
count  100000.000000  100000.000000  100000.000000  100000.000000
mean       53.931110   62590.579040       1.749618       1.941560
std        40.980893   36529.619354       0.144122       2.353844
min       -10.000000   -2000.000000       1.500000      -5.000000
25%        23.000000   37658.750000       1.630000       0.000000
50%        51.000000   59832.000000       1.750000       2.000000
75%        78.000000   82207.250000       1.870000       4.000000
max       200.000000  199994.000000       2.000000       5.000000

In [6]:
df.info() #Generar resumen del dataframe

<class 'pandas.core.frame.DataFrame'>
Index: 100000 entries, 0 to 99999
Data columns (total 7 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   Edad             100000 non-null  int64
 1   Género           90000 non-null   object
 2   Ingresos         100000 non-null  int64
 3   Altura           100000 non-null  float64
 4   Ciudad           90000 non-null   object
 5   Nivel_Educación  77563 non-null   object
 6   Hijos            100000 non-null  int64
dtypes: float64(1), int64(3), object(3)
memory usage: 6.1+ MB

In [10]:
set_gen = set(df["Género"].to_list())  #Sacar los valores que toma la columna Género
set_edu = set(df["Nivel_Educación"].to_list())
set_cui = set(df["Ciudad"].to_list())

In [13]:
set_gen # los valores de la columna genero tiene F, M y nan Xd

{'F', 'M', nan}

In [14]:
set_edu

{'Bachelor',
 'Bachelors',
 'Master',
 'PhD',
 'mastre',
 nan,
 'no education',
 'pHd'}

In [15]:
set_cui

{'Chicago', 'Houston', 'Los Angeles', 'New York', 'Phoenix', nan}

In [17]:
set_gen = set(df["Género"].to_list())

{'F', 'M', nan}

In [18]:
# Tratamiento de valores negativos
df["Edad"]= df["Edad"].apply(lambda x: np.nan if x < 0 else x)
df["Ingresos"] = df["Ingresos"].apply(lambda x: np.nan if x < 0 else x)
df["Hijos"] = df["Hijos"].apply(lambda x: np.nan if x < 0 else x)

In [20]:
# Imputar valores valtantes
for column in ["Edad", "Ingresos", "Hijos"]:
    median_value = df[column].median()
    df[column].fillna(median_value, inplace=True)

for column in ["Género", "Ciudad"]:
    mode_value = df[column].mode()[0]  # 0 es el valor 1 es cuantas veces se repite
    df[column].fillna(mode_value, inplace=True)

C:\Users\Eddy.Arias\AppData\Local\Temp\ipykernel_12264\1513661573.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[column].fillna(median_value, inplace=True)
C:\Users\Eddy.Arias\AppData\Local\Temp\ipykernel_12264\1513661573.py:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[column].fillna(mode_value, inplace=True)

In [21]:
# Mapeo de datos 
education_mapping={
    "Bachelors": "Bachelor",
    "mastre": "Master",
    "pHd": "PhD",
    "no education": "None"
}

df["Nivel_Educación"].replace(education_mapping, inplace=True)
df["Nivel_Educación"].fillna("NUe", inplace=True)

C:\Users\Eddy.Arias\AppData\Local\Temp\ipykernel_12264\3156764742.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Nivel_Educación"].replace(education_mapping, inplace=True)

In [22]:
#Casteo de tipos
df["Edad"] = df["Edad"].astype(int)
df["Hijos"] = df["Hijos"].astype(int)
df["Ingresos"] = df["Ingresos"].astype(float)
df["Altura"] = df["Altura"].astype(float)

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100000 entries, 0 to 99999
Data columns (total 7 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   Edad             100000 non-null  int32
 1   Género           100000 non-null  object
 2   Ingresos         100000 non-null  float64
 3   Altura           100000 non-null  float64
 4   Ciudad           100000 non-null  object
 5   Nivel_Educación  77563 non-null   object
 6   Hijos            100000 non-null  int32
dtypes: float64(2), int32(2), object(3)
memory usage: 5.3+ MB

In [24]:
set(df["Nivel_Educación"].to_list())

{'Bachelor', 'Master', 'None', 'PhD', nan}

In [26]:
df["Nivel_Educación"].fillna("NE", inplace=True)

C:\Users\Eddy.Arias\AppData\Local\Temp\ipykernel_12264\1092713520.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Nivel_Educación"].fillna("NE", inplace=True)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100000 entries, 0 to 99999
Data columns (total 7 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   Edad             100000 non-null  int32
 1   Género           100000 non-null  object
 2   Ingresos         100000 non-null  float64
 3   Altura           100000 non-null  float64
 4   Ciudad           100000 non-null  object
 5   Nivel_Educación  100000 non-null  object
 6   Hijos            100000 non-null  int32
dtypes: float64(2), int32(2), object(3)
memory usage: 5.3+ MB